#Alchemy
const ALCHEMY_INGREDIENT_INIT_MULT = 4.0 #4.0
const ALCHEMY_SKILL_FACTOR = 1.1 #1.1
const ALCHEMY_BASE_MULT = ALCHEMY_INGREDIENT_INIT_MULT * ALCHEMY_SKILL_FACTOR
#Alchemy base mult
const ALCHEMICAL_LORE = 1.5 #1.5
const CATALYSIS = 1.2 * 1.154 #1.2
const IMPROVEDE_LIXIRS = 1.25 #1.25
const PURIFICATION_PROCESS = 1.3 #1.5
const ALCHEMY_PERKS_MULT = ALCHEMICAL_LORE * CATALYSIS * IMPROVEDE_LIXIRS * PURIFICATION_PROCESS
#Alchemy restore mult
const RESTORE_VALUE_MULT = 1.25 * 1.25 #1.25 * 1.25

function getAlchCurrentMaxValue(baseMag, restoreValue = false)
    if restoreValue
        return baseMag * RESTORE_VALUE_MULT * ALCHEMY_PERKS_MULT * ALCHEMY_BASE_MULT
    end
    return baseMag * ALCHEMY_PERKS_MULT * ALCHEMY_BASE_MULT
end

#Катализ 1 докинуть 1.154 модификатор и в процессе очищения до 1.3 уменьшить

#=
Белый флакон
Магия 150 на 120

Урон всем 30 на 120

Броня 300 на 120

Повышение запаса сил 150 на 120
Повышение скорости 25 на 120

Резисты магия 25 на 120

Здоровье 150 на 120
=#

#=
Уязвимость к стихия яды = 100 ; 8.42 = 125 ; ингр на 25 = 100 при 6.75
Повышение навыка сника = 25 ; 2.05 = 30 ; ингр на 25 = 25 при 1.69
Уязвимость к яду = ? ;  ; ингр на 25 = 20 при 1.35
Повышение навыков магии = 25 ; ингр на 25 = 25 при 1.69 ; ингр при 0 = 20 при 1.4
Урон здоровью = 120 ; ингр на 25 = 120 при 8.1 ; корень алый = 300 при 20.2 ; ингр на 50 = 200 при 13.47 ; ингр при 0 = 75 при 5.05
Урон запасу сил = 250 ; корень алый = 300 при 20.2 ; ингр на 25 = 250 при 16.84 ; ингр на 50 = 300 при 20.2 ; ингр при 0 = 200 при 13.5
Невидимость = 50 ; корень алый = 311 при 20
Сопротивление магии = 15 ; корень алый = 30 при 2.02
Повышение брони = 100 ; ингр на 25 = 100 при 6.75 ; ингр на 50 = 150 при 10.1
Восстановление магии \ хп \ запаса сил = 12 ; ингр на 25 = 15 при 0.65
Урон магии = 170 ; ингр на 25 = 170 при 11.45
Урон магии дот = 3 на 20 ; ингр на 25 = 10 при 0.68 ; ингр на 50 = 15 при 1.01 ; ингр при 0 = 5 при 0.35
Переносимый вес = 150 ; ингр на 25 = 150 при 10.1 ; ингр на 50 = 300 при 20.2
Урон здоровью дот = 5 на 300 ; ингр на 25 = 5 при 0.34 ; ингр на 50 = 10 при 0.69
Повышение хп \ магии \ запаса сил = 50 ; ингр на 25 = 50 при 3.4 ; ингр на 50 = 100 при 6.75 ; ингр на 0 = 35 при 2.36
Замедление на 4 длит
% реген стамина \ магии = 100 на 300 ; ингр на 25 = 100 при 6.75 ; ингр на 50 = 200 при 13.5 ; ингр при 0 = 75 при 5.05
% реген хп = 250 на 300 ; ингр на 25 = 250 при 16.85 ; ингр на 50 = 400 при 26.95
повышение мастерства = 25 ; ингр на 25 = 25 при 1.69 ; ингр на 50 = 30 при 2.05
блок = мастерство
уязвимость к магии = 100
страх 2.05 = 30
взлом мастерство 1.69 = 25
резист к яду при 25 = 3.37 = 50, при 50 = 5.05
пикпокет = 50; ингр 50 = 75 при 5.05 ; ингр при 25 = 50 при 3.4

=#